"""Задание 6.	Пользователь вводит номер буквы в алфавите.
Определить, какая это буква."""
# a = int(input('Введите число: '))
# print(chr(a))

characters = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r', 't', 'u', 'v', 'w', 'x', 'y', 'z'] # Принимает а за 0 и т.д.
numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24]
a = int(input('Введите число: '))
if a in numbers:
    print(f'Введёному номеру соответствует буква: {characters[a]}')